espruino/Espruino/targets/nrf5x/jshardware.c
/**
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2013 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * Platform Specific part of Hardware interface Layer
 * ----------------------------------------------------------------------------
 */
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include "jshardware.h"
#include "jstimer.h"
#include "jsutils.h"
#include "jsparse.h"
#include "jsinteractive.h"
#include "jswrap_io.h"
#include "jswrap_date.h" // for non-F1 calendar -> days since 1970 conversion.
#ifdef BLUETOOTH
#include "jswrap_bluetooth.h"
#include "app_timer.h"
#endif

#include "nrf_gpio.h"
#include "nrf_gpiote.h"
#include "nrf_drv_twi.h"
#include "nrf_drv_gpiote.h"
#include "nrf_temp.h"
#include "nrf_timer.h"
#include "app_uart.h"
#include "nrf_drv_uart.h"

#ifdef NRF52
#include "nrf_saadc.h"
#include "nrf_pwm.h"
#else
#include "nrf_adc.h"
#endif

#include "nrf5x_utils.h"
#include "softdevice_handler.h"

#define SYSCLK_FREQ 32768 // this really needs to be a bit higher :)

/*  S110_SoftDevice_Specification_2.0.pdf

  RTC0 not usable
  RTC1 used by app_timer.c
  TIMER0 (32 bit) not usable (softdevice)
  TIMER1 (16 bit on nRF51, 32 bit on nRF52) used by jshardware util timer
  TIMER2 (16 bit) free
  SPI0/1 free

 */

static int init = 0; // Temporary hack to get jsiOneSecAfterStartup() going.
// Whether a pin is being used for soft PWM or not
BITFIELD_DECL(jshPinSoftPWM, JSH_PIN_COUNT);
/// For flash - whether it is busy or not...
volatile bool flashIsBusy = false;
volatile bool hadEvent = false; // set if we've had an event we need to deal with
bool uartIsSending = false;
bool uartInitialised = false;

/// Called when we have had an event that means we should execute JS
void jshHadEvent() {
  hadEvent = true;
}

void TIMER1_IRQHandler(void) {
  nrf_timer_task_trigger(NRF_TIMER1, NRF_TIMER_TASK_CLEAR);
  nrf_timer_event_clear(NRF_TIMER1, NRF_TIMER_EVENT_COMPARE0);
  jshHadEvent();
  jstUtilTimerInterruptHandler();
}

void sys_evt_handler(uint32_t sys_evt) {
  if (sys_evt == NRF_EVT_FLASH_OPERATION_SUCCESS){
    flashIsBusy = false;
  }
}


unsigned int getNRFBaud(int baud) {
  switch (baud) {
    case 1200: return UART_BAUDRATE_BAUDRATE_Baud1200;
    case 2400: return UART_BAUDRATE_BAUDRATE_Baud2400;
    case 4800: return UART_BAUDRATE_BAUDRATE_Baud4800;
    case 9600: return UART_BAUDRATE_BAUDRATE_Baud9600;
    case 14400: return UART_BAUDRATE_BAUDRATE_Baud14400;
    case 19200: return UART_BAUDRATE_BAUDRATE_Baud19200;
    case 28800: return UART_BAUDRATE_BAUDRATE_Baud28800;
    case 38400: return UART_BAUDRATE_BAUDRATE_Baud38400;
    case 57600: return UART_BAUDRATE_BAUDRATE_Baud57600;
    case 76800: return UART_BAUDRATE_BAUDRATE_Baud76800;
    case 115200: return UART_BAUDRATE_BAUDRATE_Baud115200;
    case 230400: return UART_BAUDRATE_BAUDRATE_Baud230400;
    case 250000: return UART_BAUDRATE_BAUDRATE_Baud250000;
    case 460800: return UART_BAUDRATE_BAUDRATE_Baud460800;
    case 921600: return UART_BAUDRATE_BAUDRATE_Baud921600;
    case 1000000: return UART_BAUDRATE_BAUDRATE_Baud1M;
    default: return 0; // error
  }
}

#ifdef BLUETOOTH
APP_TIMER_DEF(m_wakeup_timer_id);

void wakeup_handler() {
  // don't do anything - just waking is enough for us
  jshHadEvent();
}
#endif

void jshInit() {
  jshInitDevices();
  nrf_utils_lfclk_config_and_start();

  BITFIELD_CLEAR(jshPinSoftPWM);

  // Only init UART if something is connected and RX is pulled up on boot...
  jshPinSetState(DEFAULT_CONSOLE_RX_PIN, JSHPINSTATE_GPIO_IN_PULLDOWN);
  if (jshPinGetValue(DEFAULT_CONSOLE_RX_PIN)) {
    JshUSARTInfo inf;
    jshUSARTInitInfo(&inf);
    inf.pinRX = DEFAULT_CONSOLE_RX_PIN;
    inf.pinTX = DEFAULT_CONSOLE_TX_PIN;
    inf.baudRate = DEFAULT_CONSOLE_BAUDRATE;
    jshUSARTSetup(EV_SERIAL1, &inf); // Initialize UART for communication with Espruino/terminal.
  }

  init = 1;

  // Enable and sort out the timer
  nrf_timer_mode_set(NRF_TIMER1, NRF_TIMER_MODE_TIMER);
#ifdef NRF52
  nrf_timer_bit_width_set(NRF_TIMER1, NRF_TIMER_BIT_WIDTH_32);
  nrf_timer_frequency_set(NRF_TIMER1, NRF_TIMER_FREQ_1MHz);
  #define NRF_TIMER_FREQ 1000000
  #define NRF_TIMER_MAX 0xFFFFFFFF
#else
  nrf_timer_bit_width_set(NRF_TIMER1, NRF_TIMER_BIT_WIDTH_16);
  nrf_timer_frequency_set(NRF_TIMER1, NRF_TIMER_FREQ_250kHz);
  #define NRF_TIMER_FREQ 250000 // only 16 bit, so just run slower
  #define NRF_TIMER_MAX 0xFFFF
  // TODO: we could dynamically change the frequency...
#endif

  // Irq setup
  NVIC_SetPriority(TIMER1_IRQn, 3); // low - don't mess with BLE :)
  NVIC_ClearPendingIRQ(TIMER1_IRQn);
  NVIC_EnableIRQ(TIMER1_IRQn);
  nrf_timer_int_enable(NRF_TIMER1, NRF_TIMER_INT_COMPARE0_MASK );

  // Pin change
  nrf_drv_gpiote_init();
#ifdef BLUETOOTH
  jswrap_nrf_bluetooth_init();

  uint32_t err_code = app_timer_create(&m_wakeup_timer_id,
                      APP_TIMER_MODE_SINGLE_SHOT,
                      wakeup_handler);
  if (err_code) jsiConsolePrintf("app_timer_create error %d\n", err_code);
#endif
  
  // Softdevice is initialised now
  softdevice_sys_evt_handler_set(sys_evt_handler);
}

// When 'reset' is called - we try and put peripherals back to their power-on state
void jshReset() {
  jshResetDevices();
  // TODO: Reset all pins to their power-on state (apart from default UART :)
}

void jshKill() {

}

// stuff to do on idle
void jshIdle() {
  if (init == 1) {
    jsiOneSecondAfterStartup(); // Do this the first time we enter jshIdle() after we have called jshInit() and never again.
    init = 0;
  }
}

/// Get this IC's serial number. Passed max # of chars and a pointer to write to. Returns # of chars
int jshGetSerialNumber(unsigned char *data, int maxChars) {
    if (maxChars <= 0)
    {
    	return 0;
    }
	return nrf_utils_get_device_id(data, maxChars);
}

